Repository: JeanPierreNduwimana/TP1_Flutter
Catalog: lib/l10n/intl_*.arb
Languages: fr

# connection
source: Log In
fr: Se Connecter

# inscription
source: Register
fr: S'inscrire

# deconnexion
source: Log Out
fr: Déconnexion

source: Username
fr: nom d'utilisateur

source: Password
fr: Mot de passe

# confirmpassword
source: Confirm your password
fr: Confirme ton mot de passe

# loadindTaskList
source: Loading your tasks...
fr: chargement de vos taches...

source: Home
fr: Accueil

source: Task Detail
fr: Consultation de tache

source: Time Used
fr: Temps utilisé

source: Update Progression
fr: Mise à jour de progression

source: Delete
fr: Supprimer

# createTask
source: Create your task
fr: Créér votre tâche

source: Create
fr: Créer

# vipredirect
source: Direct access...
fr: Patientez, vous allez être rediriger...

# emptyfields
source: No field can be empty ☹
fr: Aucun des champs ne peut être vide ☹

source: Welcome
fr: Bienvenue

# InternalAuthenticationServiceException
source: User not found. Please sign up
fr: Utilisateur inexistant veuillez vous inscrire

# BadCredentialsException
source: Invalid password. Please try again
fr: Mot de passe invalide. Essayer de nouveau

# UsernameAlreadyTaken
source: User already exists
fr: Utilisateur existe deja

# UsernameTooShort
source: The chosen name is too short
fr: Le nom choisi est trop court

# PasswordTooShort
source: Your password is too short
fr: Votre mot de passe est trop court

# Empty
source: Task name is empty
fr: Nom de la tâche est vide

# SamePassword
source: Passwords do not match
fr: Mot de passes ne corresponds pas

# Existing
source: Task name already exists
fr: Nom de la tâche existe déjà️

# TooShort
source: Task name is too short
fr: Nom de la tâche est trop court️

# UnkownError
source: Unknown error
fr: Erreur inconnu

# connectionError
source: Sorry, no connection 😟 Please check your network
fr: Désolé il n'y a pas de connection 😣 Veuillez vérifiez votre réseau

# noTask
source: No tasks available
fr: Aucune tache disponible

source: Reload
fr: Recharger

# addTask
source: Add a task
fr: Ajout une tache

source: Loading...
fr: Chargement...

# errorUploadImage
source: The server didn't like this image, try another one and it will work, promise 😉
fr: Le serveur n'a pas aimé cette image, essayer avec une autre et ca marchera, promis 😉

# taskUpdatedMessage
source: Task is updated 👌
fr: La tache est mise à jour 👌

# deletedTaskMessage
source: The task {taskName} is deleted 🔪
fr: La tache {taskName} est supprimé 🔪

source: Task Name
fr: Nom de la tache
